app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "name", "text", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-04-18 20:26:13.459220"], ["name", "test_name"], ["text", "texttext"], ["updated_at", "2014-04-18 20:26:13.459220"]]
---
  def create
    a = Article.create(name: params["name"], text: params["text"])

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 980190963]]
---
  def destroy
    atr = Article.find(params["id"])
    a = Article.destroy(atr.id)

UPDATE "articles" SET "name" = ?, "updated_at" = ? WHERE "articles"."id" = 980190963  [["name", "Petr"], ["updated_at", "2014-04-21 06:26:23.001323"]]
---
  def update
    a = Article.update(params["id"], {name: params["name"]})

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 980190963]]
---
  def show
    @articles = Article.find(params["id"])

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 980190963]]
---
  def edit
    @articles = Article.find(params["id"])